Revit 2024 API
BuiltInFailures.WallFailures.FaceIsNoGoodForWall Property
 Defining face is not suitable for walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FaceIsNoGoodForWall { get; }
Visual Basic
Public Shared ReadOnly Property FaceIsNoGoodForWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FaceIsNoGoodForWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace